// 4. Создайте обработчик нажатия на кнопку, который будет 
// менять цвет фона страницы.
// 5.Создайте HTML-форму и по нажатию на кнопку проверяйте
// заполненность всех полей. Если останутся незаполненные поля 
// — выводите предупреждение и не отправляйте форму.
// 6.Создайте обработчик события на нажатие кнопок направлений
//  (влево, вправо) так, чтобы HTML-элемент при однократном
//   нажатии на кнопку анимированно сдвигался влево или вправо
//    на 100px
// 7.Навесьте на событие движения мыши обработчик, который
//  будет в консоль выводить координаты движения. Примечание:
//   выводите их как x и y. Событие надо «повесить» на document

let btn = document.querySelector('#btn');

btn.addEventListener('click',(event)=>{
    document.body.style.background = 'black'
     })

let bt = document.querySelector('#bt');

bt.addEventListener('click',(event)=>{
    document.body.style.background = 'white'
     })



